In [1]:
import pandas as pd

In [2]:
#Lets create a series object
s_1 = pd.Series([2,5,8,3])
print(s_1.values)

[2 5 8 3]

In [3]:
s_1.index

RangeIndex(start=0, stop=4, step=1)

In [4]:
s_1.index = ['a', 'g', 'q', 'k']

In [5]:
print(s_1.values)

[2 5 8 3]

In [6]:
s_1.index

Index(['a', 'g', 'q', 'k'], dtype='object')

In [7]:
s_1.q

8

In [8]:
#Creatingb dataframe using pandas
df = {'Names': ['Aman', 'Anuj', 'Dheeraj'],
     'Age': [21,22,28],
     'Subject': ['Eng', 'Maths', 'Science']}

In [9]:
class_df = pd.DataFrame(df, index = ['Enployer_1', 'employer_2', 'Enmbhcd_3'], columns= ['Names', 'Age', 'Subject'])

In [10]:
print(class_df)

              Names  Age  Subject
Enployer_1     Aman   21      Eng
employer_2     Anuj   22    Maths
Enmbhcd_3   Dheeraj   28  Science

In [11]:
class_df.Names

Enployer_1       Aman
employer_2       Anuj
Enmbhcd_3     Dheeraj
Name: Names, dtype: object

In [13]:
#Lets add new entry to the dataframe
import numpy as np

In [14]:
class_df.ix['Employer_4'] = ['Ashay', np.nan, 'History']

/home/aman/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [15]:
class_df.T

        Enployer_1 employer_2 Enmbhcd_3 Employer_4
Names         Aman       Anuj   Dheeraj      Ashay
Age             21         22        28        NaN
Subject        Eng      Maths   Science    History

In [16]:
class_df.append(['Aman', np.nan, 'chemistry'])

                    0   Age    Names  Subject
Enployer_1        NaN  21.0     Aman      Eng
employer_2        NaN  22.0     Anuj    Maths
Enmbhcd_3         NaN  28.0  Dheeraj  Science
Employer_4        NaN   NaN    Ashay  History
0                Aman   NaN      NaN      NaN
1                 NaN   NaN      NaN      NaN
2           chemistry   NaN      NaN      NaN

In [17]:
class_df.sort_values(by='Names')

              Names   Age  Subject
Enployer_1     Aman  21.0      Eng
employer_2     Anuj  22.0    Maths
Employer_4    Ashay   NaN  History
Enmbhcd_3   Dheeraj  28.0  Science

In [18]:
#Lets add one more to the given dataset of the series object
col_entry = pd.Series(['A', 'B', 'A+', 'C'], index = ['Enployer_1', 'employer_2', 'Employer_4', 'Enmbhcd_3'])

In [19]:
class_df['Grades'] = col_entry

In [21]:
print(class_df)

              Names   Age  Subject Grades
Enployer_1     Aman  21.0      Eng      A
employer_2     Anuj  22.0    Maths      B
Enmbhcd_3   Dheeraj  28.0  Science      C
Employer_4    Ashay   NaN  History     A+

In [22]:
#finding the missing entries in the dataframe
class_df.fillna(10, inplace=True)

In [23]:
print(class_df)

              Names   Age  Subject Grades
Enployer_1     Aman  21.0      Eng      A
employer_2     Anuj  22.0    Maths      B
Enmbhcd_3   Dheeraj  28.0  Science      C
Employer_4    Ashay  10.0  History     A+

In [24]:
#Lets now concatenate the two dataframe
exp = pd.DataFrame(data = {'Experience': [1,0,1,2]}, index = ['Enployer_1', 'employer_2', 'Employer_4', 'Enmbhcd_3'])

In [26]:
print(exp)

            Experience
Enployer_1           1
employer_2           0
Employer_4           1
Enmbhcd_3            2

In [27]:
class_data = pd.concat([class_df, exp], axis=1)

/home/aman/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [28]:
print(class_data)

              Names   Age  Subject Grades  Experience
Employer_4    Ashay  10.0  History     A+           1
Enmbhcd_3   Dheeraj  28.0  Science      C           2
Enployer_1     Aman  21.0      Eng      A           1
employer_2     Anuj  22.0    Maths      B           0

In [30]:
class_data_1 = pd.concat([class_df, exp], axis=0)

/home/aman/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [31]:
print(class_data_1)

             Age  Experience Grades    Names  Subject
Enployer_1  21.0         NaN      A     Aman      Eng
employer_2  22.0         NaN      B     Anuj    Maths
Enmbhcd_3   28.0         NaN      C  Dheeraj  Science
Employer_4  10.0         NaN     A+    Ashay  History
Enployer_1   NaN         1.0    NaN      NaN      NaN
employer_2   NaN         0.0    NaN      NaN      NaN
Employer_4   NaN         1.0    NaN      NaN      NaN
Enmbhcd_3    NaN         2.0    NaN      NaN      NaN

In [32]:
#Map Functon
class_data['Names'] = class_data['Names'].map(lambda x : x + 'Nm')
class_data['Names']

Employer_4      AshayNm
Enmbhcd_3     DheerajNm
Enployer_1       AmanNm
employer_2       AnujNm
Name: Names, dtype: object

In [33]:
#Apply function
def age_add(X):
    return X+1

print(class_data['Age'])

Employer_4    10.0
Enmbhcd_3     28.0
Enployer_1    21.0
employer_2    22.0
Name: Age, dtype: float64

In [34]:
print(class_data['Age'].apply(age_add))

Employer_4    11.0
Enmbhcd_3     29.0
Enployer_1    22.0
employer_2    23.0
Name: Age, dtype: float64

In [35]:
#changing datatype of the columns
class_data['Grades'] = class_data['Grades'].astype('category')

In [36]:
class_data.Grades.dtypes

CategoricalDtype(categories=['A', 'A+', 'B', 'C'], ordered=False)

In [37]:
#Storing the whole result of the prepared dataset using the pandas and the num[py function
class_data.to_csv('abc.csv', index = False)